Applying:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_folder.Dev will be created
  + resource "grafana_folder" "Dev" {
      + id    = (known after apply)
      + title = "Dev"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

  # grafana_folder.Production will be created
  + resource "grafana_folder" "Production" {
      + id    = (known after apply)
      + title = "Production"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

  # grafana_folder.Staging will be created
  + resource "grafana_folder" "Staging" {
      + id    = (known after apply)
      + title = "Staging"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```